'''
В файле "Goal.py" показано, как должны выглядеть входные данные в коде
и окончательный чек с именами
''' 

# Входные данные
names = ["Vlad", "Lexa", "Andrey"]
menu = {
    {
        "dish": "Борщ",
        "price": 220,
        "count": 1
    },
    {
        "dish": "Селедка под шубой",
        "price": 550,
        "count": 2
    },
    {
        "dish": "Чай",
        "price": 150,
        "count": 3
    }
}


'''
Так должен выглядеть итоговый чек.
На его основе будет рассчитана сумма, которую должен заплатить каждый человек
''' 
split_bill = {
    "Vlad":[
        {
            "dish": "Борщ",
            "price": 220,
            "count": 1
        },
        {
            "dish": "Селедка под шубой",
            "price": 275,
            "count": 1
        },
        {
            "dish": "Чай",
            "price": 50,
            "count": 1
        }
    ],
    "Lexa": [
        {
            "dish": "Чай",
            "price": 50,
            "count": 1
        }
    ],
    "Andrey": [
        {
            "dish": "Чай",
            "price": 50,
            "count": 1
        },
        {
            "dish": "Селедка под шубой",
            "price": 275,
            "count": 1
        }
    ]
}